MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_sbs.h
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_ll_sbs.h
  * @brief   Header file of LL SBS module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file in the root directory of this software
  * component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32C5XX_LL_SBS_H
#define STM32C5XX_LL_SBS_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx.h"

/** @addtogroup STM32C5xx_LL_Driver
  * @{
  */
#if defined (SBS)

/** @defgroup LL_SBS LL SBS
  * @{
  */

/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup SBS_LL_Private_Constants LL SBS private constants
  * @{
  */
#define LL_SBS_HDPL_INCREMENT_VALUE 0x6AU /*!< Define used for the HDPL increment */
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup SBS_LL_Exported_Constants LL SBS Constants
  * @{
  */

/** @defgroup LL_SBS_HDPL_Value  HDPL Value
  * @{
  */
#define LL_SBS_HDPL_VALUE_1 0x00000051U /*!< Hide protection level 1 */
#define LL_SBS_HDPL_VALUE_2 0x0000008AU /*!< Hide protection level 2 */
#define LL_SBS_HDPL_VALUE_3 0x0000006FU /*!< Hide protection level 3 */
/**
  * @}
  */

#if defined(SBS_NEXTHDPLCR_NEXTHDPL)
/** @defgroup LL_SBS_Next_HDP_Level_Selection  SBS Next HDP Level Selection
  * @{
  */
#define LL_SBS_HDP_OBK_0 0x00000000U               /*!< Index to add to the current HDPL to point (through OBK-HDPL) to the next secure storage areas */
#define LL_SBS_HDP_OBK_1 SBS_NEXTHDPLCR_NEXTHDPL_0 /*!< Index to add to the current HDPL to point (through OBK-HDPL) to the next secure storage areas */
#define LL_SBS_HDP_OBK_2 SBS_NEXTHDPLCR_NEXTHDPL_1 /*!< Index to add to the current HDPL to point (through OBK-HDPL) to the next secure storage areas */
#define LL_SBS_HDP_OBK_3 SBS_NEXTHDPLCR_NEXTHDPL   /*!< Index to add to the current HDPL to point (through OBK-HDPL) to the next secure storage areas */
/**
  * @}
  */
#endif /* SBS_NEXTHDPLCR_NEXTHDPL */
#if defined(SBS_PMCR_ADC1_IN2_REMAP)
/** @defgroup LL_SBS_EC_CHANNEL_PIN_REMAP CHANNEL PIN REMAP
  * @{
  */
#define LL_SBS_REMAP_ADC_IN7_TO_PB1 SBS_PMCR_ADC1_IN7_REMAP   /*!< Enable ADC1 IN7 pin remap */
#define LL_SBS_REMAP_ADC_IN6_TO_PB0 SBS_PMCR_ADC1_IN6_REMAP   /*!< Enable ADC1 IN6 pin remap */
#define LL_SBS_REMAP_ADC_IN5_TO_PC5 SBS_PMCR_ADC1_IN5_REMAP   /*!< Enable ADC1 IN5 pin remap */
#define LL_SBS_REMAP_ADC_IN2_TO_PC4 SBS_PMCR_ADC1_IN2_REMAP   /*!< Enable ADC1 IN2 pin remap */
#define LL_SBS_REMAP_ADC_IN_ALL     (SBS_PMCR_ADC1_IN2_REMAP | \
                                     SBS_PMCR_ADC1_IN5_REMAP | \
                                     SBS_PMCR_ADC1_IN6_REMAP | \
                                     SBS_PMCR_ADC1_IN7_REMAP) /*!< Enable all ADC1 pins remap */
/**
  * @}
  */
#endif /* SBS_PMCR_ADC1_IN2_REMAP */
#if defined(ETH1_BASE)

/** @defgroup SBS_LL_EC_PERIPH_ETH SBS peripheral ETH
  * @{
  */
#define LL_SBS_PERIPH_ETH1 0x100U /*!< SBS_PMCR register address offset value */
/**
  * @}
  */

/** @defgroup SBS_LL_EC_ETHINTPOL SBS Ethernet external PHY interrupt polarity configuration
  * @{
  */
#define LL_SBS_ETHPHY_IT_POL_ACTIVE_HIGH 0U                  /*!< Ethernet external PHY interrupt polarity active high */
#define LL_SBS_ETHPHY_IT_POL_ACTIVE_LOW  SBS_PMCR_ETH1INTPOL /*!< Ethernet external PHY interrupt polarity active low  */
/**
  * @}
  */

/** @defgroup SBS_LL_EC_SBS_ETH_PHYSEL SBS Ethernet PHY interface selection
  * @{
  */
#define LL_SBS_ETHPHY_ITF_GMII_MII 0U                      /*!< GMII or MII interface */
#define LL_SBS_ETHPHY_ITF_RMII     SBS_PMCR_ETH1_SEL_PHY_2 /*!< RMII interface */
/**
  * @}
  */

/** @defgroup SBS_LL_EC_SBS_ETH_TXLPI_STATUS SBS Ethernet TXLPI status
  * @{
  */
#define LL_SBS_ETH_POWER_DOWN_ACTIVE    0U                 /*!< Ethernet power down sequence active    */
#define LL_SBS_ETH_POWER_DOWN_COMPLETED SBS_PMCR_ETH1PDACK /*!< Ethernet power down sequence completed */
/**
  * @}
  */

/** @defgroup SBS_LL_EC_SBS_ETH_TXLPI_MODE_STATUS SBS Ethernet TXLPI mode status
  * @{
  */
#define LL_SBS_ETHMAC_TXLPI_ACTIVE 0U                 /*!< Ethernet TXLPI mode disabled */
#define LL_SBS_ETHMAC_TXLPI_LPI    SBS_PMCR_ETH1TXLPI /*!< Ethernet TXLPI mode enabled  */
/**
  * @}
  */
#endif /* ETH1_BASE */

/** @defgroup SBS_LL_EC_FLOATING_POINT_UNIT_INTERRUPTs SBS floating point unit interrupts
  * @{
  */
#define LL_SBS_IT_FPU_IOC SBS_FPUIMR_FPU_IE_0                         /*!< Invalid operation interrupt */
#define LL_SBS_IT_FPU_DZC SBS_FPUIMR_FPU_IE_1                         /*!< Divide-by-zero interrupt    */
#define LL_SBS_IT_FPU_UFC SBS_FPUIMR_FPU_IE_2                         /*!< underflow interrupt         */
#define LL_SBS_IT_FPU_OFC SBS_FPUIMR_FPU_IE_3                         /*!< Overflow interrupt          */
#define LL_SBS_IT_FPU_IDC SBS_FPUIMR_FPU_IE_4                         /*!< Input abnormal interrupt    */
#define LL_SBS_IT_FPU_IXC SBS_FPUIMR_FPU_IE_5                         /*!< Inexact interrupt           */
#define LL_SBS_IT_FPU_ALL (SBS_FPUIMR_FPU_IE_0 | SBS_FPUIMR_FPU_IE_1 | \
                           SBS_FPUIMR_FPU_IE_2 | SBS_FPUIMR_FPU_IE_3 | \
                           SBS_FPUIMR_FPU_IE_4 | SBS_FPUIMR_FPU_IE_5) /*!< All floating point unit interrupts */
/**
  * @}
  */

/** @defgroup LL_SBS_Erase_Status_Flags SBS Erase status Flags
  * @{
  */
#define LL_SBS_FLAG_IPMEE SBS_MESR_IPMEE /*!< ICACHE erase status flag         */
#define LL_SBS_FLAG_MCLR  SBS_MESR_MCLR  /*!< SRAM2, ICACHE, erase status flag */
/**
  * @}
  */

/** @defgroup SBS_LL_EC_CCELL_CODE SBS compensation cell Code source
  * @{
  */
#define LL_SBS_CCELL_VDDIO SBS_CCCSR_EN1   /*!< Compensation cell selection for VDDIO */

#define LL_SBS_CCELL_CODE_DEFAULT 0U /*!< I/Os code from the cell (available in the SBS_CCVALR)               */
#define LL_SBS_CCELL_CODE_CUSTOM  1U /*!< I/Os code from the SBS compensation cell software code register (SBS_CCSWCR) */
/**
  * @}
  */

