MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_sbs.h
/** @defgroup SBS_LL_EC_CS1 SBS Vdd compensation cell Code selection
  * @{
  */
#define LL_SBS_CCELL_VDDIO_DEFAULT_CODE 0U           /*!< VDD I/Os code from the cell (available in the SBS_CCVALR)               */
#define LL_SBS_CCELL_VDDIO_CUSTOM_CODE  SBS_CCCSR_CS1 /*!< VDD I/Os code from the SBS compensation cell code register (SBS_CCSWCR) */
/**
  * @}
  */

/** @defgroup LL_SBS_EC_TIM_BREAK_INPUTS SBS TIM break inputs
  * @{
  */
#define LL_SBS_FLASH_ECC_DOUBLE_ERROR SBS_CFGR2_ECCL /*!< Enables and locks the Flash ECC double error signal with Break Input of TIM1/8/15/16/17 */
#define LL_SBS_PVD                    SBS_CFGR2_PVDL /*!< Enables and locks the PVD connection with TIM1/8/15/16/17 Break Input */
#define LL_SBS_SRAM_ECC_DOUBLE_ERROR  SBS_CFGR2_SEL  /*!< Enables and locks the SRAM ECC double error signal with Break Input of TIM1/8/15/16/17 */
#define LL_SBS_LOCKUP_OUT             SBS_CFGR2_CLL  /*!< Enables and locks the LOCKUP (Hardfault) output of Cortex-M33 with Break Input of TIM1/8/15/16/17 */
#define LL_SBS_TIM_BREAK_INPUTS_ALL   (SBS_CFGR2_ECCL | SBS_CFGR2_PVDL | \
                                       SBS_CFGR2_SEL | SBS_CFGR2_CLL) /*!< Enables and locks the all with Break Input */
/**
  * @}
  */

/** @defgroup LL_SBS_Lock_Core_Register SBS Lock Core Register
  * @{
  */
#define LL_SBS_CPU_LOCK_VTOR SBS_CLCKR_LOCKVTOR                       /*!< VTOR register lock */
#define LL_SBS_CPU_LOCK_MPU  SBS_CLCKR_LOCKMPU                        /*!< MPU register lock  */
#define LL_SBS_CPU_LOCK_ALL  (SBS_CLCKR_LOCKMPU | SBS_CLCKR_LOCKVTOR) /*!< All secure registers lock */
/**
  * @}
  */

/**
  * @}
  */
/* Exported macro ------------------------------------------------------------*/
/** @defgroup SBS_LL_Exported_Macros LL SBS Macros
  * @{
  */

/** @defgroup SBS_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in SBS register.
  * @param  reg Register to be written
  * @param  value Value to be written in the register
  */
#define LL_SBS_WRITE_REG(reg, value) STM32_WRITE_REG(SBS->reg, (value))

/**
  * @brief  Read a value in SBS register.
  * @param  reg Register to be read
  * @retval Register value
  */
#define LL_SBS_READ_REG(reg) STM32_READ_REG(SBS->reg)
/**
  * @}
  */

/**
  * @}
  */
/* Exported functions --------------------------------------------------------*/

/** @defgroup SBS_LL_Exported_Functions LL SBS Functions
  * @{
  */

/** @defgroup LL_SBS_EF_HDPL_Management HDPL Management
  * @{
  */

/**
  * @brief  Increment by 1 the HDPL value.
  * @rmtoll
  *  HDPLCR     HDPL_INCR      LL_SBS_IncrementHDPLevel
  */
__STATIC_INLINE void LL_SBS_IncrementHDPLevel(void)
{
  STM32_MODIFY_REG(SBS->HDPLCR, SBS_HDPLCR_INCR_HDPL, LL_SBS_HDPL_INCREMENT_VALUE);
}

/**
  * @brief  Get the HDPL Value.
  * @rmtoll
  *  HDPLSR     HDPL      LL_SBS_GetHDPLevel
  * @retval  Returns the HDPL value
  *          This return value can be one of the following values:
  *           @arg @ref LL_SBS_HDPL_VALUE_1 : HDPL1
  *           @arg @ref LL_SBS_HDPL_VALUE_2 : HDPL2
  *           @arg @ref LL_SBS_HDPL_VALUE_3 : HDPL3
  */
__STATIC_INLINE uint32_t LL_SBS_GetHDPLevel(void)
{
  return (uint32_t)(STM32_READ_BIT(SBS->HDPLSR, SBS_HDPLSR_HDPL));
}

#if defined(SBS_NEXTHDPLCR_NEXTHDPL)
/**
  * @brief  Set the OBK-HDPL Value.
  * @rmtoll
  *  NEXTHDPLCR     NEXTHDPL      LL_SBS_SetOBKHDPLevel
  * @param  value Value of increment to add to HDPL value to generate the OBK-HDPL.
  *         This parameter can be one of the following values:
  *         @arg @ref LL_SBS_HDP_OBK_0 : HDPL
  *         @arg @ref LL_SBS_HDP_OBK_1 : HDPL + 1
  *         @arg @ref LL_SBS_HDP_OBK_2 : HDPL + 2
  *         @arg @ref LL_SBS_HDP_OBK_3 : HDPL + 3
  */
__STATIC_INLINE void LL_SBS_SetOBKHDPLevel(uint32_t value)
{
  STM32_MODIFY_REG(SBS->NEXTHDPLCR, SBS_NEXTHDPLCR_NEXTHDPL, (uint32_t)(value));
}

/**
  * @brief  Get the OBK-HDPL Value.
  * @rmtoll
  *  NEXTHDPLCR     NEXTHDPL      LL_SBS_GetOBKHDPLevel
  * @retval  Returns the incremement to add to HDPL value to generate OBK-HDPL
  *          This return value can be one of the following values:
  *          @arg @ref LL_SBS_HDP_OBK_0 : HDPL
  *          @arg @ref LL_SBS_HDP_OBK_1 : HDPL + 1
  *          @arg @ref LL_SBS_HDP_OBK_2 : HDPL + 2
  *          @arg @ref LL_SBS_HDP_OBK_3 : HDPL + 3
  */
__STATIC_INLINE  uint32_t LL_SBS_GetOBKHDPLevel(void)
{
  return (uint32_t)(STM32_READ_BIT(SBS->NEXTHDPLCR, SBS_NEXTHDPLCR_NEXTHDPL));
}
#endif /* SBS_NEXTHDPLCR_NEXTHDPL */

/**
  * @}
  */

#if defined(SBS_PMCR_ADC1_IN2_REMAP)
/** @defgroup LL_SBS_EF_Channel_Pin_Remap Channel Pin Remap
  * @{
  */

/**
  * @brief  Enable the ADC channel pin remap.
  * @rmtoll
  *  PMCR     ADC1_IN2_REMAP   LL_SBS_EnableADCChannelPinRemap \n
  *  PMCR     ADC1_IN5_REMAP   LL_SBS_EnableADCChannelPinRemap \n
  *  PMCR     ADC1_IN6_REMAP   LL_SBS_EnableADCChannelPinRemap \n
  *  PMCR     ADC1_IN7_REMAP   LL_SBS_EnableADCChannelPinRemap
  * @param  adc_channel_pin_remap This parameter can be one or a combination of the following values:
  *         @arg @ref LL_SBS_REMAP_ADC_IN7_TO_PB1
  *         @arg @ref LL_SBS_REMAP_ADC_IN6_TO_PB0
  *         @arg @ref LL_SBS_REMAP_ADC_IN5_TO_PC5
  *         @arg @ref LL_SBS_REMAP_ADC_IN2_TO_PC4
  *         @arg @ref LL_SBS_REMAP_ADC_IN_ALL
  */
__STATIC_INLINE void LL_SBS_EnableADCChannelPinRemap(uint32_t adc_channel_pin_remap)
{
  STM32_SET_BIT(SBS->PMCR, adc_channel_pin_remap);
}

/**
  * @brief  Disable the ADC channel pin remap.
  * @rmtoll
  *  PMCR      ADC1_IN2_REMAP  LL_SBS_DisableADCChannelPinRemap \n
  *  PMCR      ADC1_IN5_REMAP  LL_SBS_DisableADCChannelPinRemap \n
  *  PMCR      ADC1_IN6_REMAP  LL_SBS_DisableADCChannelPinRemap \n
  *  PMCR      ADC1_IN7_REMAP  LL_SBS_DisableADCChannelPinRemap
  * @param  adc_channel_pin_remap This parameter can be one or a combination of the following values:
  *         @arg @ref LL_SBS_REMAP_ADC_IN7_TO_PB1
  *         @arg @ref LL_SBS_REMAP_ADC_IN6_TO_PB0
  *         @arg @ref LL_SBS_REMAP_ADC_IN5_TO_PC5
  *         @arg @ref LL_SBS_REMAP_ADC_IN2_TO_PC4
  *         @arg @ref LL_SBS_REMAP_ADC_IN_ALL
  */
__STATIC_INLINE void LL_SBS_DisableADCChannelPinRemap(uint32_t adc_channel_pin_remap)
{
  STM32_CLEAR_BIT(SBS->PMCR, adc_channel_pin_remap);
}

/**
  * @brief  Check if channel pin remap is enabled or disabled.
  * @rmtoll
  *  PMCR      ADC1_IN2_REMAP   LL_SBS_IsEnabledADCChannelPinRemap \n
  *  PMCR      ADC1_IN5_REMAP   LL_SBS_IsEnabledADCChannelPinRemap \n
  *  PMCR      ADC1_IN6_REMAP   LL_SBS_IsEnabledADCChannelPinRemap \n
  *  PMCR      ADC1_IN7_REMAP   LL_SBS_IsEnabledADCChannelPinRemap
  * @param  adc_channel_pin_remap This parameter can be one or a combination of the following values:
  *         @arg @ref LL_SBS_REMAP_ADC_IN7_TO_PB1
  *         @arg @ref LL_SBS_REMAP_ADC_IN6_TO_PB0
  *         @arg @ref LL_SBS_REMAP_ADC_IN5_TO_PC5
  *         @arg @ref LL_SBS_REMAP_ADC_IN2_TO_PC4
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledADCChannelPinRemap(uint32_t adc_channel_pin_remap)
{
  return ((STM32_READ_BIT(SBS->PMCR, adc_channel_pin_remap) == adc_channel_pin_remap) ? 1UL : 0UL);
}

/**
  * @}
  */
#endif /* SBS_PMCR_ADC1_IN2_REMAP */
#if defined(ETH1_BASE)
/** @defgroup LL_SBS_EF_ETHERNET_Management ETHERNET Management
  * @{
  */

/**
  * @brief  Select the ethernet PHY interface.
  * @rmtoll
  *  PMCR     ETH_SEL_PHYx   LL_SBS_SetETHPHYInterface
  * @param  eth_periph This parameter can be one of the following values:
  *         @arg @ref LL_SBS_PERIPH_ETH1
  * @param  interface This parameter can be one of the following values:
  *         @arg @ref LL_SBS_ETHPHY_ITF_GMII_MII
  *         @arg @ref LL_SBS_ETHPHY_ITF_RMII
  */
__STATIC_INLINE void LL_SBS_SetETHPHYInterface(uint32_t eth_periph, uint32_t interface)
{
  STM32_UNUSED(eth_periph);
  STM32_MODIFY_REG(SBS->PMCR, SBS_PMCR_ETH1_SEL_PHY, interface);
}

/**
  * @brief  Get the ethernet interface.
  * @rmtoll
  *  PMCR     ETH_SEL_PHYx   LL_SBS_GetETHPHYInterface
  * @param  eth_periph This parameter can be one of the following values:
  *         @arg @ref LL_SBS_PERIPH_ETH1
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SBS_ETHPHY_ITF_GMII_MII
  *         @arg @ref LL_SBS_ETHPHY_ITF_RMII
  */
__STATIC_INLINE uint32_t LL_SBS_GetETHPHYInterface(uint32_t eth_periph)
{
  STM32_UNUSED(eth_periph);
  return (uint32_t)(STM32_READ_BIT(SBS->PMCR, SBS_PMCR_ETH1_SEL_PHY));
}

/**
  * @brief  Set the ethernet external PHY interrupt polarity.
  * @rmtoll
  *  PMCR     ETHINTPOL   LL_SBS_SetETHExternalPHYInterruptPolarity
  * @param  eth_periph This parameter can be one of the following values:
  *         @arg @ref LL_SBS_PERIPH_ETH1
  * @param  polarity This parameter can be one of the following values:
  *         @arg @ref LL_SBS_ETHPHY_IT_POL_ACTIVE_HIGH
  *         @arg @ref LL_SBS_ETHPHY_IT_POL_ACTIVE_LOW
  */
__STATIC_INLINE void LL_SBS_SetETHExternalPHYInterruptPolarity(uint32_t eth_periph, uint32_t polarity)
{
  STM32_UNUSED(eth_periph);
  STM32_MODIFY_REG(SBS->PMCR, SBS_PMCR_ETH1INTPOL, polarity);
}

/**
  * @brief  Get the ethernet external PHY interrupt polarity.
  * @rmtoll
  *  PMCR     ETHINTPOL   LL_SBS_GetETHExternalPHYInterruptPolarity
  * @param  eth_periph This parameter can be one of the following values:
  *         @arg @ref LL_SBS_PERIPH_ETH1
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SBS_ETHPHY_IT_POL_ACTIVE_HIGH
  *         @arg @ref LL_SBS_ETHPHY_IT_POL_ACTIVE_LOW
  */
__STATIC_INLINE uint32_t LL_SBS_GetETHExternalPHYInterruptPolarity(uint32_t eth_periph)
{
  STM32_UNUSED(eth_periph);
  return (uint32_t)(STM32_READ_BIT(SBS->PMCR, SBS_PMCR_ETH1INTPOL));
}

/**
  * @brief  Get the ethernet power-down acknowledge.
  * @rmtoll
  *  PMCR     ETHPDACK   LL_SBS_GetETHPowerDownAck
  * @param  eth_periph This parameter can be one of the following values:
  *         @arg @ref LL_SBS_PERIPH_ETH1
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SBS_ETH_POWER_DOWN_ACTIVE
  *         @arg @ref LL_SBS_ETH_POWER_DOWN_COMPLETED
  */
__STATIC_INLINE uint32_t LL_SBS_GetETHPowerDownAck(uint32_t eth_periph)
{
  STM32_UNUSED(eth_periph);
  return (uint32_t)(STM32_READ_BIT(SBS->PMCR, SBS_PMCR_ETH1PDACK));
}

/**
  * @brief  Get the ethernet TxLPI mode status.
  * @rmtoll
  *  PMCR     ETHTXLPI   LL_SBS_GetETHMACTXLPIStatus
  * @param  eth_periph This parameter can be one of the following values:
  *         @arg @ref LL_SBS_PERIPH_ETH1
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SBS_ETHMAC_TXLPI_ACTIVE
  *         @arg @ref LL_SBS_ETHMAC_TXLPI_LPI
  */
__STATIC_INLINE uint32_t LL_SBS_GetETHMACTXLPIStatus(uint32_t eth_periph)
{
  STM32_UNUSED(eth_periph);
  return (uint32_t)(STM32_READ_BIT(SBS->PMCR, SBS_PMCR_ETH1TXLPI));
}

/**
  * @}
  */
#endif /* ETH1_BASE */

/** @defgroup LL_SBS_EF_FPUIT_Management FPUIT Management
  * @{
  */

/**
  * @brief  Enable floating point unit interrupts bits.
  * @rmtoll
  *  FPUIMR FPU_IE_0   LL_SBS_EnableFPUIT \n
  *  FPUIMR FPU_IE_1   LL_SBS_EnableFPUIT \n
  *  FPUIMR FPU_IE_2   LL_SBS_EnableFPUIT \n
  *  FPUIMR FPU_IE_3   LL_SBS_EnableFPUIT \n
  *  FPUIMR FPU_IE_4   LL_SBS_EnableFPUIT \n
  *  FPUIMR FPU_IE_5   LL_SBS_EnableFPUIT
  * @param  floating_point This parameter can be one or a combination of the following values:
  *         @arg @ref LL_SBS_IT_FPU_IOC
  *         @arg @ref LL_SBS_IT_FPU_DZC
  *         @arg @ref LL_SBS_IT_FPU_UFC
  *         @arg @ref LL_SBS_IT_FPU_OFC
  *         @arg @ref LL_SBS_IT_FPU_IDC
  *         @arg @ref LL_SBS_IT_FPU_IXC
  *         @arg @ref LL_SBS_IT_FPU_ALL
  */
__STATIC_INLINE void LL_SBS_EnableFPUIT(uint32_t floating_point)
{
  STM32_SET_BIT(SBS->FPUIMR, floating_point);
}

/**
  * @brief  Disable floating point unit interrupts bits.
  * @rmtoll
  *  FPUIMR FPU_IE_0   LL_SBS_DisableFPUIT \n
  *  FPUIMR FPU_IE_1   LL_SBS_DisableFPUIT \n
  *  FPUIMR FPU_IE_2   LL_SBS_DisableFPUIT \n
  *  FPUIMR FPU_IE_3   LL_SBS_DisableFPUIT \n
  *  FPUIMR FPU_IE_4   LL_SBS_DisableFPUIT \n
  *  FPUIMR FPU_IE_5   LL_SBS_DisableFPUIT
  * @param  floating_point This parameter can be one or a combination of the following values:
  *         @arg @ref LL_SBS_IT_FPU_IOC
  *         @arg @ref LL_SBS_IT_FPU_DZC
  *         @arg @ref LL_SBS_IT_FPU_UFC
  *         @arg @ref LL_SBS_IT_FPU_OFC
  *         @arg @ref LL_SBS_IT_FPU_IDC
  *         @arg @ref LL_SBS_IT_FPU_IXC
  *         @arg @ref LL_SBS_IT_FPU_ALL
  */
__STATIC_INLINE void LL_SBS_DisableFPUIT(uint32_t floating_point)
{
  STM32_CLEAR_BIT(SBS->FPUIMR, floating_point);
}

/**
  * @brief  Check if floating point unit interrupts bits is enabled.
  * @rmtoll
  *  FPUIMR FPU_IE_0   LL_SBS_IsEnabledFPUIT \n
  *  FPUIMR FPU_IE_1   LL_SBS_IsEnabledFPUIT \n
  *  FPUIMR FPU_IE_2   LL_SBS_IsEnabledFPUIT \n
  *  FPUIMR FPU_IE_3   LL_SBS_IsEnabledFPUIT \n
  *  FPUIMR FPU_IE_4   LL_SBS_IsEnabledFPUIT \n
  *  FPUIMR FPU_IE_5   LL_SBS_IsEnabledFPUIT
  * @param  floating_point This parameter can be one of the following values:
  *         @arg @ref LL_SBS_IT_FPU_IOC
  *         @arg @ref LL_SBS_IT_FPU_DZC
  *         @arg @ref LL_SBS_IT_FPU_UFC
  *         @arg @ref LL_SBS_IT_FPU_OFC
  *         @arg @ref LL_SBS_IT_FPU_IDC
  *         @arg @ref LL_SBS_IT_FPU_IXC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledFPUIT(uint32_t floating_point)
{
  return ((STM32_READ_BIT(SBS->FPUIMR, floating_point) == floating_point) ? 1UL : 0UL);
}

/**
  * @brief  Enable Floating Point Unit Invalid operation Interrupt.
  * @rmtoll
  *  FPUIMR     FPU_IE_0      LL_SBS_EnableIT_FPU_IOC
  */
__STATIC_INLINE void LL_SBS_EnableIT_FPU_IOC(void)
{
  STM32_SET_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_0);
}

/**
  * @brief  Enable Floating Point Unit Divide-by-zero Interrupt.
  * @rmtoll
  *  FPUIMR     FPU_IE_1      LL_SBS_EnableIT_FPU_DZC
  */
__STATIC_INLINE void LL_SBS_EnableIT_FPU_DZC(void)
{
  STM32_SET_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_1);
}

/**
  * @brief  Enable Floating Point Unit Underflow Interrupt.
  * @rmtoll
  *  FPUIMR     FPU_IE_2      LL_SBS_EnableIT_FPU_UFC
  */
__STATIC_INLINE void LL_SBS_EnableIT_FPU_UFC(void)
{
  STM32_SET_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_2);
}

/**
  * @brief  Enable Floating Point Unit Overflow Interrupt.
  * @rmtoll
  *  FPUIMR     FPU_IE_3      LL_SBS_EnableIT_FPU_OFC
  */
__STATIC_INLINE void LL_SBS_EnableIT_FPU_OFC(void)
{
  STM32_SET_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_3);
}

/**
  * @brief  Enable Floating Point Unit Input denormal Interrupt.
  * @rmtoll
  *  FPUIMR     FPU_IE_4      LL_SBS_EnableIT_FPU_IDC
  */
__STATIC_INLINE void LL_SBS_EnableIT_FPU_IDC(void)
{
  STM32_SET_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_4);
}

/**
  * @brief  Enable Floating Point Unit Inexact Interrupt.
  * @rmtoll
  *  FPUIMR     FPU_IE_5      LL_SBS_EnableIT_FPU_IXC
  */
__STATIC_INLINE void LL_SBS_EnableIT_FPU_IXC(void)
{
  STM32_SET_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_5);
}

/**
  * @brief  Disable Floating Point Unit Invalid operation Interrupt.
  * @rmtoll
  *  FPUIMR     FPU_IE_0      LL_SBS_DisableIT_FPU_IOC
  */
__STATIC_INLINE void LL_SBS_DisableIT_FPU_IOC(void)
{
  STM32_CLEAR_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_0);
}

/**
  * @brief  Disable Floating Point Unit Divide-by-zero Interrupt.
  * @rmtoll
  *  FPUIMR      FPU_IE_1      LL_SBS_DisableIT_FPU_DZC
  */
__STATIC_INLINE void LL_SBS_DisableIT_FPU_DZC(void)
{
  STM32_CLEAR_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_1);
}

/**
  * @brief  Disable Floating Point Unit Underflow Interrupt.
  * @rmtoll
  *  FPUIMR     FPU_IE_2      LL_SBS_DisableIT_FPU_UFC
  */
__STATIC_INLINE void LL_SBS_DisableIT_FPU_UFC(void)
{
  STM32_CLEAR_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_2);
}

/**
  * @brief  Disable Floating Point Unit Overflow Interrupt.
  * @rmtoll
  *  FPUIMR     FPU_IE_3      LL_SBS_DisableIT_FPU_OFC
  */
__STATIC_INLINE void LL_SBS_DisableIT_FPU_OFC(void)
{
  STM32_CLEAR_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_3);
}

/**
  * @brief  Disable Floating Point Unit Input denormal Interrupt.
  * @rmtoll
  *  FPUIMR     FPU_IE_4      LL_SBS_DisableIT_FPU_IDC
  */
__STATIC_INLINE void LL_SBS_DisableIT_FPU_IDC(void)
{
  STM32_CLEAR_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_4);
}

/**
  * @brief  Disable Floating Point Unit Inexact Interrupt.
  * @rmtoll
  *  FPUIMR     FPU_IE_5      LL_SBS_DisableIT_FPU_IXC
  */
__STATIC_INLINE void LL_SBS_DisableIT_FPU_IXC(void)
{
  STM32_CLEAR_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_5);
}

/**
  * @brief  Check if Floating Point Unit Invalid operation Interrupt source is enabled or disabled.
  * @rmtoll
  *  FPUIMR     FPU_IE_0      LL_SBS_IsEnabledIT_FPU_IOC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledIT_FPU_IOC(void)
{
  return ((STM32_READ_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_0) == SBS_FPUIMR_FPU_IE_0) ? 1UL : 0UL);
}

/**
  * @brief  Check if Floating Point Unit Divide-by-zero Interrupt source is enabled or disabled.
  * @rmtoll
  *  FPUIMR     FPU_IE_1      LL_SBS_IsEnabledIT_FPU_DZC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledIT_FPU_DZC(void)
{
  return ((STM32_READ_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_1) == SBS_FPUIMR_FPU_IE_1) ? 1UL : 0UL);
}

/**
  * @brief  Check if Floating Point Unit Underflow Interrupt source is enabled or disabled.
  * @rmtoll
  *  FPUIMR     FPU_IE_2      LL_SBS_IsEnabledIT_FPU_UFC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledIT_FPU_UFC(void)
{
  return ((STM32_READ_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_2) == SBS_FPUIMR_FPU_IE_2) ? 1UL : 0UL);
}

/**
  * @brief  Check if Floating Point Unit Overflow Interrupt source is enabled or disabled.
  * @rmtoll
  *  FPUIMR     FPU_IE_3      LL_SBS_IsEnabledIT_FPU_OFC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledIT_FPU_OFC(void)
{
  return ((STM32_READ_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_3) == SBS_FPUIMR_FPU_IE_3) ? 1UL : 0UL);
}

/**
  * @brief  Check if Floating Point Unit Input denormal Interrupt source is enabled or disabled.
  * @rmtoll
  *  FPUIMR FPU_IE_4      LL_SBS_IsEnabledIT_FPU_IDC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledIT_FPU_IDC(void)
{
  return ((STM32_READ_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_4) == SBS_FPUIMR_FPU_IE_4) ? 1UL : 0UL);
}

/**
  * @brief  Check if Floating Point Unit Inexact Interrupt source is enabled or disabled.
  * @rmtoll
  *  FPUIMR FPU_IE_5      LL_SBS_IsEnabledIT_FPU_IXC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledIT_FPU_IXC(void)
{
  return ((STM32_READ_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_5) == SBS_FPUIMR_FPU_IE_5) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup SBS_LL_EF_ERASE_MEMORIE_STATUS SBS ERASE MEMORIES STATUS
  * @{
  */

/**
  * @brief  Clear Status of End of Erase for ICACHE RAMs.
  * @rmtoll
  *  MESR   IPMEE    LL_SBS_ClearFlag_IPMEE
  */
__STATIC_INLINE void LL_SBS_ClearFlag_IPMEE(void)
{
  STM32_SET_BIT(SBS->MESR, SBS_MESR_IPMEE);
}

/**
  * @brief  Get Status of End of Erase for ICACHE RAM.
  * @rmtoll
  *  MESR   IPMEE    LL_SBS_IsActiveFlag_IPMEE
  * @retval retrieve the state of the IPMEE flag (1U or 0U).
  */
__STATIC_INLINE uint32_t LL_SBS_IsActiveFlag_IPMEE(void)
{
  return ((STM32_READ_BIT(SBS->MESR, SBS_MESR_IPMEE) == SBS_MESR_IPMEE) ? 1UL : 0UL);
}

/**
  * @brief  Clear Status of End of Erase after reset for SRAM2 and ICACHE RAMs.
  * @rmtoll
  *  MESR   MCLR    LL_SBS_ClearFlag_MCLR
  */
__STATIC_INLINE void LL_SBS_ClearFlag_MCLR(void)
{
  STM32_SET_BIT(SBS->MESR, SBS_MESR_MCLR);
}

/**
  * @brief  Get Status of End of Erase after reset for SRAM2 and ICACHE RAMs.
  * @rmtoll
  *  MESR   MCLR    LL_SBS_IsActiveFlag_MCLR
  * @retval retrieve the state of the MCLR flag (1U or 0U).
  */
__STATIC_INLINE uint32_t LL_SBS_IsActiveFlag_MCLR(void)
{
  return ((STM32_READ_BIT(SBS->MESR, SBS_MESR_MCLR) == SBS_MESR_MCLR) ? 1UL : 0UL);
}

/**
  * @brief Clear the SBS memories erase status pending flag(s).
  * @param flag This parameter can be one or a combination of the following values:
  *        @arg @ref LL_SBS_FLAG_IPMEE
  *        @arg @ref LL_SBS_FLAG_MCLR
  */
__STATIC_INLINE void LL_SBS_ClearFlag(uint32_t flag)
{
  STM32_SET_BIT(SBS->MESR, flag);
}

/**
  * @brief Check if an SBS memories erase status flag is active or not.
  * @param flag This parameter can be one of the following values:
  *        @arg @ref LL_SBS_FLAG_IPMEE
  *        @arg @ref LL_SBS_FLAG_MCLR
  * @retval retrieve the state of the selected memory flag (1U or 0U).
  */
__STATIC_INLINE uint32_t LL_SBS_IsActiveFlag(uint32_t flag)
{
  return ((STM32_READ_BIT(SBS->MESR, flag) == flag) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup LL_SBS_EF_COMPENSATION Compensation Cell Control
  * @{
  */

/**
  * @brief  Set the compensation cell code.
  * @rmtoll
  *  CCCSR    CSx LL_SBS_SetCompensationCellCodeSrc
  * @param  comp_cell This parameter can be the following values:
  *         @arg @ref LL_SBS_CCELL_VDDIO
  * @param  code_source: This parameter can be one of the following values:
  *         @arg @ref LL_SBS_CCELL_CODE_DEFAULT
  *         @arg @ref LL_SBS_CCELL_CODE_CUSTOM
  * @note  x= [1]
  */
__STATIC_INLINE void LL_SBS_SetCompensationCellCodeSrc(uint32_t comp_cell, uint32_t code_source)
{
  STM32_ATOMIC_MODIFY_REG_32(SBS->CCCSR, (comp_cell << 1U), (code_source * (comp_cell << 1U)));
}

/**
  * @brief  Get the compensation cell code.
  * @rmtoll
  *  CCCSR    CSx    LL_SBS_GetCompensationCellCodeSrc
  * @param  comp_cell This parameter can be the following values:
  *         @arg @ref LL_SBS_CCELL_VDDIO
  * @retval Returned value can be one of the following values:
  *   @arg LL_SBS_CCELL_CODE_DEFAULT : Selected Code is from the cell (available in the SBS_CCVALR)
  *   @arg LL_SBS_CCELL_CODE_CUSTOM  : Selected Code is from the SBS compensation
  *                                           cell software code register (SBS_CCSWCR)
  * @note  x= [1]
  */
__STATIC_INLINE uint32_t LL_SBS_GetCompensationCellCodeSrc(uint32_t comp_cell)
{
  return (STM32_READ_BIT(SBS->CCCSR,
                         (SBS_CCCSR_CS1 << STM32_POSITION_VAL(comp_cell))) >> STM32_POSITION_VAL(comp_cell << 1U));
}

/**
  * @brief  Set the compensation cell code selection of GPIO supplied by VDD.
  * @rmtoll
  *  CCCSR   CS1    LL_SBS_SetVddIOCompensationCellCodeSource
  * @param  code_source: Select the code to be applied for the Vdd compensation cell
  *   This parameter can be one of the following values:
  *   @arg LL_SBS_CCELL_VDDIO_DEFAULT_CODE : Select Code from the cell (available in the SBS_CCVALR)
  *   @arg LL_SBS_CCELL_VDDIO_CUSTOM_CODE  : Select Code from the SBS compensation cell
  *                                                  software code register (SBS_CCSWCR)
  */
__STATIC_INLINE void LL_SBS_SetVddIOCompensationCellCodeSource(uint32_t code_source)
{
  STM32_ATOMIC_MODIFY_REG_32(SBS->CCCSR, SBS_CCCSR_CS1, code_source);
}

/**
  * @brief  Get the compensation cell code selection of GPIO supplied by VDD.
  * @rmtoll
  *  CCCSR   CS1    LL_SBS_GetVddIOCompensationCellCodeSource
  * @retval Returned value can be one of the following values:
  *   @arg LL_SBS_CCELL_VDDIO_DEFAULT_CODE : Selected Code is from the cell (available in the SBS_CCVALR)
  *   @arg LL_SBS_CCELL_VDDIO_CUSTOM_CODE: Selected Code is from the SBS compensation cell
  *                                            software code register (SBS_CCSWCR)
  */
__STATIC_INLINE uint32_t LL_SBS_GetVddIOCompensationCellCodeSource(void)
{
  return (uint32_t)(STM32_READ_BIT(SBS->CCCSR, SBS_CCCSR_CS1));
}

