MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_sbs.h
/**
  * @brief  Enable the Compensation Cell.
  * @rmtoll
  *  CCCSR   ENX    LL_SBS_EnableCompensationCell
  * @param  comp_cell This parameter can be one or a combination of the following values:
  *         @arg @ref LL_SBS_CCELL_VDDIO
  * @note  X= [1]
  */
__STATIC_INLINE void LL_SBS_EnableCompensationCell(uint32_t comp_cell)
{
  STM32_ATOMIC_SET_BIT_32(SBS->CCCSR, comp_cell);
}

/**
  * @brief  Disable the Compensation Cell.
  * @rmtoll
  *  CCCSR   ENX    LL_SBS_DisableCompensationCell
  * @param  comp_cell This parameter can be one or a combination of the following values:
  *         @arg @ref LL_SBS_CCELL_VDDIO
  * @note  X= [1]
  */
__STATIC_INLINE void LL_SBS_DisableCompensationCell(uint32_t comp_cell)
{
  STM32_ATOMIC_CLEAR_BIT_32(SBS->CCCSR, comp_cell);
}

/**
  * @brief  Check if the Compensation Cell is enable.
  * @rmtoll
  *  CCCSR   ENx    LL_SBS_IsEnabledCompensationCell
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref LL_SBS_CCELL_VDDIO
  * @note  x= [1]
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledCompensationCell(uint32_t comp_cell)
{
  return ((STM32_READ_BIT(SBS->CCCSR, comp_cell) == comp_cell) ? 1U : 0U);
}

/**
  * @brief  Enable the Compensation Cell of GPIO supplied by VDD.
  * @rmtoll
  *  CCCSR   EN1    LL_SBS_EnableVddIOCompensationCell
  */
__STATIC_INLINE void LL_SBS_EnableVddIOCompensationCell(void)
{
  STM32_ATOMIC_SET_BIT_32(SBS->CCCSR, SBS_CCCSR_EN1);
}

/**
  * @brief  Disable the Compensation Cell of GPIO supplied by VDD.
  * @rmtoll
  *  CCCSR   EN1    LL_SBS_DisableVddIOCompensationCell
  */
__STATIC_INLINE void LL_SBS_DisableVddIOCompensationCell(void)
{
  STM32_ATOMIC_CLEAR_BIT_32(SBS->CCCSR, SBS_CCCSR_EN1);
}

/**
  * @brief  Check if the Compensation Cell of GPIO supplied by VDD is enable.
  * @rmtoll
  *  CCCSR   EN1    LL_SBS_IsEnabledVddIOCompensationCell
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledVddIOCompensationCell(void)
{
  return ((STM32_READ_BIT(SBS->CCCSR, SBS_CCCSR_EN1) == SBS_CCCSR_EN1) ? 1UL : 0UL);
}

/**
  * @brief  Get the PMOS transistor of the compensation cell value.
  * @rmtoll
  *  CCVALR  APSRCx  LL_SBS_GetPMOSCompensationCellValue
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref LL_SBS_CCELL_VDDIO
  * @note  x= [1]
  * @retval Returned value of the PMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SBS_GetPMOSCompensationCellValue(uint32_t comp_cell)
{
  return STM32_READ_BIT(SBS->CCVALR, SBS_CCVALR_APSRC1) >> (STM32_POSITION_VAL(comp_cell << 1U) * 4U);
}

/**
  * @brief  Get the NMOS transistor of the compensation cell value.
  * @rmtoll
  *  CCVALR    ANSRC1x   LL_SBS_GetNMOSCompensationCellValue
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref LL_SBS_CCELL_VDDIO
  * @note  x= [1]
  * @retval Returned value of the NMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SBS_GetNMOSCompensationCellValue(uint32_t comp_cell)
{
  return STM32_READ_BIT(SBS->CCVALR, SBS_CCVALR_ANSRC1) >> (STM32_POSITION_VAL(comp_cell) * 4U);
}

/**
  * @brief  Get the compensation cell value of the GPIO PMOS transistor supplied by VDD.
  * @rmtoll
  *  CCVALR    APSRC1   LL_SBS_GetPMOSVddIOCompensationCellValue
  * @retval Returned value is the PMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SBS_GetPMOSVddIOCompensationCellValue(void)
{
  return (uint32_t)(STM32_READ_BIT(SBS->CCVALR, SBS_CCVALR_APSRC1));
}

/**
  * @brief  Get the compensation cell value of the GPIO NMOS transistor supplied by VDD.
  * @rmtoll
  *  CCVALR    ANSRC1   LL_SBS_GetNMOSVddIOCompensationCellValue
  * @retval Returned value is the NMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SBS_GetNMOSVddIOCompensationCellValue(void)
{
  return (uint32_t)(STM32_READ_BIT(SBS->CCVALR, SBS_CCVALR_ANSRC1));
}

/**
  * @brief  Set the compensation cell code of PMOS transistor.
  * @rmtoll
  *  CCSWCR    APSRC1   LL_SBS_SetPMOSCompensationCellCode
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref LL_SBS_CCELL_VDDIO
  * @param  pmos_code PMOS compensation code
  * @note   This code is applied to the PMOS compensation cell when the CSx x=[1] bits of the SBS_CCCSR is set
  */
__STATIC_INLINE void LL_SBS_SetPMOSCompensationCellCode(uint32_t comp_cell, uint32_t pmos_code)
{
  STM32_ATOMIC_MODIFY_REG_32(SBS->CCSWCR, SBS_CCSWCR_SW_APSRC1,
                             (pmos_code << (STM32_POSITION_VAL(comp_cell << 1U) * 4U)));
}

/**
  * @brief  Get the compensation cell code of PMOS transistor.
  * @rmtoll
  *  CCSWCR    APSRC1   LL_SBS_GetPMOSCompensationCellCode
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref LL_SBS_CCELL_VDDIO
  * @retval Returned value of the PMOS compensation cell
  * @note   This code is applied to the PMOS compensation cell when the CSx x=[1] bits of the SBS_CCCSR is set
  */
__STATIC_INLINE uint32_t LL_SBS_GetPMOSCompensationCellCode(uint32_t comp_cell)
{
  return (STM32_READ_BIT(SBS->CCSWCR, (SBS_CCSWCR_SW_APSRC1 << (STM32_POSITION_VAL(comp_cell) * 4U))));
}

/**
  * @brief  Set the compensation cell code of NMOS transistor.
  * @rmtoll
  *  CCSWCR    ANSRC1   LL_SBS_SetNMOSCompensationCellCode
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref LL_SBS_CCELL_VDDIO
  * @param  nmos_code PMOS compensation code
  * @note   This code is applied to the PMOS compensation cell when the CSx x=[1] bits of the SBS_CCCSR is set
  */
__STATIC_INLINE void LL_SBS_SetNMOSCompensationCellCode(uint32_t comp_cell, uint32_t nmos_code)
{
  STM32_ATOMIC_MODIFY_REG_32(SBS->CCSWCR, SBS_CCSWCR_SW_ANSRC1, (nmos_code << (STM32_POSITION_VAL(comp_cell) * 4U)));
}

/**
  * @brief  Get the NMOS transistor of the compensation cell value.
  * @rmtoll
  *  CCSWCR    ANSRC1   LL_SBS_GetNMOSCompensationCellCode
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref LL_SBS_CCELL_VDDIO
  * @note   This code is applied to the NMOS compensation cell when the CSx x=[1] bits of the SBS_CCCSR is set
  * @retval Returned value of the NMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SBS_GetNMOSCompensationCellCode(uint32_t comp_cell)
{
  return (STM32_READ_BIT(SBS->CCSWCR, (SBS_CCSWCR_SW_ANSRC1 << (STM32_POSITION_VAL(comp_cell) * 4U))));
}

/**
  * @brief  Set the compensation cell code of the GPIO PMOS and NMOS transistor supplied by VDD.
  * @rmtoll
  *  CCSWCR    ANSRC1  LL_SBS_SetxMOSVddIOCompensationCellCode \n
  *  CCSWCR    APSRC1  LL_SBS_SetxMOSVddIOCompensationCellCode
  * @param  pmos_code PMOS compensation code
  *         This code is applied to the PMOS compensation cell when the CS1 bit of the
  *         SBS_CCCSR is set
  * @param  nmos_code NMOS compensation code
  *         This code is applied to the NMOS compensation cell when the CS1 bit of the
  *         SBS_CCCSR is set
  */
__STATIC_INLINE void LL_SBS_SetxMOSVddIOCompensationCellCode(uint32_t pmos_code, uint32_t nmos_code)
{
  STM32_MODIFY_REG(SBS->CCSWCR, (SBS_CCSWCR_SW_APSRC1 | SBS_CCSWCR_SW_ANSRC1),
                   ((pmos_code << SBS_CCSWCR_SW_APSRC1_Pos) | (nmos_code << SBS_CCSWCR_SW_ANSRC1_Pos)));
}

/**
  * @brief  Set the compensation cell code of the GPIO PMOS transistor supplied by VDD.
  * @rmtoll
  *  CCSWCR    APSRC1  LL_SBS_SetPMOSVddIOCompensationCellCode
  * @param  pmos_code PMOS compensation code
  *         This code is applied to the PMOS compensation cell when the CS1 bit of the
  *         SBS_CCCSR is set
  */
__STATIC_INLINE void LL_SBS_SetPMOSVddIOCompensationCellCode(uint32_t pmos_code)
{
  STM32_MODIFY_REG(SBS->CCSWCR, SBS_CCSWCR_SW_APSRC1, pmos_code << SBS_CCSWCR_SW_APSRC1_Pos);
}

/**
  * @brief  Get the compensation cell code of the GPIO PMOS transistor supplied by VDD.
  * @rmtoll
  *  CCSWCR    APSRC1   LL_SBS_GetPMOSVddIOCompensationCellCode
  * @retval Returned value is the PMOS compensation cell
  */
__STATIC_INLINE uint32_t LL_SBS_GetPMOSVddIOCompensationCellCode(void)
{
  return (uint32_t)(STM32_READ_BIT(SBS->CCSWCR, SBS_CCSWCR_SW_APSRC1));
}

/**
  * @brief  Set the compensation cell code of the GPIO NMOS transistor supplied by VDD.
  * @rmtoll
  *  CCSWCR    APSRC1  LL_SBS_SetNMOSVddIOCompensationCellCode
  * @param  nmos_code NMOS compensation code
  *         This code is applied to the NMOS compensation cell when the CS1 bit of the
  *         SBS_CCCSR is set
  */
__STATIC_INLINE void LL_SBS_SetNMOSVddIOCompensationCellCode(uint32_t nmos_code)
{
  STM32_MODIFY_REG(SBS->CCSWCR, SBS_CCSWCR_SW_ANSRC1, nmos_code << SBS_CCSWCR_SW_ANSRC1_Pos);
}

/**
  * @brief  Get the compensation cell code of the GPIO NMOS transistor supplied by VDD.
  * @rmtoll
  *  CCSWCR    ANSRC1   LL_SBS_GetNMOSVddIOCompensationCellCode
  * @retval Returned value is the Vdd compensation cell code for NMOS transistors
  */
__STATIC_INLINE uint32_t LL_SBS_GetNMOSVddIOCompensationCellCode(void)
{
  return (uint32_t)(STM32_READ_BIT(SBS->CCSWCR, SBS_CCSWCR_SW_ANSRC1));
}

/**
  * @brief  Get Compensation Cell ready Flag of GPIO supplied by VDD.
  * @rmtoll
  *  CCCSR   RDY1   LL_SBS_IsActiveFlag_RDY1
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsActiveFlag_RDY1(void)
{
  return ((STM32_READ_BIT(SBS->CCCSR, SBS_CCCSR_RDY1) == (SBS_CCCSR_RDY1)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup LL_SBS_EF_TIM_Break_Management TIM Break Management
  * @{
  */

/**
  * @brief  Set connections to TIM1/8/15/16/17 break inputs.
  * @rmtoll
  *  CFGR2 CLL          LL_SBS_EnableTIMBreakInputs \n
  *  CFGR2 SEL          LL_SBS_EnableTIMBreakInputs \n
  *  CFGR2 PVDL         LL_SBS_EnableTIMBreakInputs \n
  *  CFGR2 ECCL         LL_SBS_EnableTIMBreakInputs
  * @param  break_input This parameter can be one or a combination of the following values:
  *         @arg @ref LL_SBS_FLASH_ECC_DOUBLE_ERROR
  *         @arg @ref LL_SBS_PVD
  *         @arg @ref LL_SBS_SRAM_ECC_DOUBLE_ERROR
  *         @arg @ref LL_SBS_LOCKUP_OUT
  */
__STATIC_INLINE void LL_SBS_EnableTIMBreakInputs(uint32_t break_input)
{
  STM32_SET_BIT(SBS->CFGR2, break_input);
}

/**
  * @brief  Clear connections to TIM1/8/15/16/17 break inputs.
  * @rmtoll
  *  CFGR2   ECCL    LL_SBS_DisableTIMBreakInputs
  * @param  break_input This parameter can be one or a combination of the following values:
  *         @arg @ref LL_SBS_SRAM_ECC_DOUBLE_ERROR
  */
__STATIC_INLINE void LL_SBS_DisableTIMBreakInputs(uint32_t break_input)
{
  STM32_CLEAR_BIT(SBS->CFGR2, break_input);
}

/**
  * @brief  Get connections to TIM1/8/15/16/17 break inputs.
  * @rmtoll
  *  CFGR2   CLL     LL_SBS_IsEnabledTIMBreakInputs \n
  *  CFGR2   SPL     LL_SBS_IsEnabledTIMBreakInputs \n
  *  CFGR2   PVDL    LL_SBS_IsEnabledTIMBreakInputs \n
  *  CFGR2   ECCL    LL_SBS_IsEnabledTIMBreakInputs
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref LL_SBS_FLASH_ECC_DOUBLE_ERROR
  *         @arg @ref LL_SBS_PVD
  *         @arg @ref LL_SBS_SRAM_ECC_DOUBLE_ERROR
  *         @arg @ref LL_SBS_LOCKUP_OUT
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledTIMBreakInputs(uint32_t break_input)
{
  return ((STM32_READ_BIT(SBS->CFGR2, break_input) == (break_input)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup LL_SBS_EF_Lock_Management Lock Management
  * @{
  */

/**
  * @brief  Lock of SBS CPU registers.
  *         Lock(s) cleared only at system reset.
  * @rmtoll
  *  CLCKR       LOCKVTOR     LL_SBS_CPU_LockRegisters \n
  *  CLCKR       LOCKMPU      LL_SBS_CPU_LockRegisters
  * @param  core_regs
  *         This parameter can be one of the following values :
  *          @arg @ref LL_SBS_CPU_LOCK_VTOR
  *          @arg @ref LL_SBS_CPU_LOCK_MPU
  *          @arg @ref LL_SBS_CPU_LOCK_ALL
  * @retval None
  */
__STATIC_INLINE void LL_SBS_CPU_LockRegisters(uint32_t core_regs)
{
  STM32_SET_BIT(SBS->CLCKR, core_regs);
}

/**
  * @brief  Check if the SBS CPU register is locked.
  * @rmtoll
  *  CLCKR     LOCKVTOR     LL_SBS_CPU_IsLockedRegisters \n
  *  CLCKR     LOCKMPU      LL_SBS_CPU_IsLockedRegisters
  * @retval the return value can be one of the following values :
  *          @arg @ref LL_SBS_CPU_LOCK_VTOR
  *          @arg @ref LL_SBS_CPU_LOCK_MPU
  */
__STATIC_INLINE uint32_t LL_SBS_CPU_IsLockedRegisters(uint32_t core_regs)
{
  return ((STM32_READ_BIT(SBS->CLCKR, core_regs) == (core_regs)) ? 1UL : 0UL);
}

/**
  * @brief  Lock of SBS VTOR register.
  *         Lock(s) cleared only at system reset.
  * @rmtoll
  *  CLCKR       LOCKVTOR     LL_SBS_LockVTOR
  */
__STATIC_INLINE void LL_SBS_LockVTOR(void)
{
  STM32_SET_BIT(SBS->CLCKR, SBS_CLCKR_LOCKVTOR);
}

/**
  * @brief  Check if the SBS VTOR register is locked.
  * @rmtoll
  *  CLCKR     LOCKVTOR     LL_SBS_IsLockedVTOR
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsLockedVTOR(void)
{
  return ((STM32_READ_BIT(SBS->CLCKR, SBS_CLCKR_LOCKVTOR) == (SBS_CLCKR_LOCKVTOR)) ? 1UL : 0UL);
}

/**
  * @brief  Lock of SBS MPU register.
  *         Lock(s) cleared only at system reset.
  * @rmtoll
  *  CLCKR       LOCKMPU     LL_SBS_LockMPU
  */
__STATIC_INLINE void LL_SBS_LockMPU(void)
{
  STM32_SET_BIT(SBS->CLCKR, SBS_CLCKR_LOCKMPU);
}

/**
  * @brief  Check if the SBS MPU register is locked.
  * @rmtoll
  *  CLCKR     LOCKMPU     LL_SBS_IsLockedMPU
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsLockedMPU(void)
{
  return ((STM32_READ_BIT(SBS->CLCKR, SBS_CLCKR_LOCKMPU) == (SBS_CLCKR_LOCKMPU)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup LL_SBS_EF_FLASH_Management FLASH Management
  * @{
  */

/**
  * @brief  Disable the NMI in case of double ECC error in FLASH Interface.
  * @rmtoll
  *  ECCNMIR     SBS_ECCNMIR_ECCNMI_MASK_EN      LL_SBS_FLASH_DisableECCNMI
  */
__STATIC_INLINE  void LL_SBS_FLASH_DisableECCNMI(void)
{
  STM32_SET_BIT(SBS->ECCNMIR, SBS_ECCNMIR_ECCNMI_MASK_EN);
}

/**
  * @brief  Enable the NMI in case of double ECC error in FLASH Interface.
  * @rmtoll
  *  ECCNMIR     SBS_ECCNMIR_ECCNMI_MASK_EN      LL_SBS_FLASH_EnableECCNMI
  */
__STATIC_INLINE  void LL_SBS_FLASH_EnableECCNMI(void)
{
  STM32_CLEAR_BIT(SBS->ECCNMIR, SBS_ECCNMIR_ECCNMI_MASK_EN);
}

/**
  * @brief  Check if the NMI is Disabled in case of double ECC error in FLASH Interface.
  * @rmtoll
  *  ECCNMIR     SBS_ECCNMIR_ECCNMI_MASK_EN      LL_SBS_FLASH_IsEnabledECCNMI
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE  uint32_t LL_SBS_FLASH_IsEnabledECCNMI(void)
{
  return ((STM32_READ_BIT(SBS->ECCNMIR, SBS_ECCNMIR_ECCNMI_MASK_EN) == SBS_ECCNMIR_ECCNMI_MASK_EN) ? 0UL : 1UL);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* SBS */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32C5XX_LL_SBS_H */
